using System;

/*****************************************************************************/

namespace lab6_v8.library.Model
{
    /// <summary>
    /// Каждая книга характеризуется автором (выбирается из списка),
    /// названием, издательством(выбирается из списка), годом издания.
    /// </summary>
    public class Book
    {
        /*-------------------------------------------------------------------*/

        public Guid Id { get; private set; }

        /*-------------------------------------------------------------------*/

        public Author Author { get; set; }

        /*-------------------------------------------------------------------*/

        public string Title { get; set; }

        /*-------------------------------------------------------------------*/

        public Publisher Publisher { get; set; }

        /*-------------------------------------------------------------------*/

        public short Year { get; set; }

        /*-------------------------------------------------------------------*/

        public Book(Guid id)
        {
            this.Id = id;
        }

        /*-------------------------------------------------------------------*/

        public Book(Guid id, Author author, string title, Publisher publisher, short year)
            : this(id)
        {

            this.Author = author;
            this.Title = title;
            this.Publisher = publisher;
            this.Year = year;
        }

        /*-------------------------------------------------------------------*/


    }
}

/*****************************************************************************/
